; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v3 - type_1 ?v7 - type_2)
 	      (pred_3 ?v5 - object ?v7 - type_2)
	      (pred_2 ?v3 - type_1 ?v2 - type_3)
	      (pred_1 ?v3 - type_1 ?v5 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v3 - type_1 ?v8 ?v4 - type_2)
       :precondition (and  (pred_4 ?v3 ?v8))
       :effect (and  (pred_4 ?v3 ?v4)
		     (not (pred_4 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_1 ?v1 - object ?v6 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v6) (pred_4 ?v3 ?v6) (pred_2 ?v3 ?v2))
       :effect (and (pred_1 ?v3 ?v1 ?v2)
		    (not (pred_3 ?v1 ?v6)) 
		    (not (pred_2 ?v3 ?v2))))

   (:action op_1
       :parameters (?v3 - type_1 ?v1 - object ?v6 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v1 ?v2) (pred_4 ?v3 ?v6))
       :effect (and (pred_3 ?v1 ?v6)
		    (pred_2 ?v3 ?v2)
		    (not (pred_1 ?v3 ?v1 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_04 - type_1
obj_05 obj_01 obj_12 obj_07 - type_3
obj_10 obj_03 obj_08 obj_06 - type_2
obj_02 obj_13 obj_09 - object)
(:init
(pred_4 obj_11 obj_08)
(pred_2 obj_11 obj_05)
(pred_2 obj_11 obj_01)
(pred_4 obj_04 obj_10)
(pred_2 obj_04 obj_12)
(pred_2 obj_04 obj_07)
(pred_3 obj_02 obj_06)
(pred_3 obj_13 obj_10)
(pred_3 obj_09 obj_03)
)
(:goal
(and
(pred_3 obj_02 obj_10)
(pred_3 obj_13 obj_08)
(pred_3 obj_09 obj_10)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_06)))
)
)

; plan
1. (op_2 obj_04 obj_13 obj_10 obj_07)
   deleted: (pred_3 obj_13 obj_10) (pred_2 obj_04 obj_07)
   added: (pred_1 obj_04 obj_13 obj_07)
   goals met: 0 of 3
2. (op_3 obj_11 obj_08 obj_03)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_03)
   goals met: 0 of 3
3. (op_3 obj_04 obj_10 obj_08)
   deleted: (pred_4 obj_04 obj_10)
   added: (pred_4 obj_04 obj_08)
   goals met: 0 of 3
4. (op_2 obj_11 obj_09 obj_03 obj_01)
   deleted: (pred_3 obj_09 obj_03) (pred_2 obj_11 obj_01)
   added: (pred_1 obj_11 obj_09 obj_01)
   goals met: 0 of 3
5. (op_1 obj_04 obj_13 obj_08 obj_07)
   deleted: (pred_1 obj_04 obj_13 obj_07)
   added: (pred_3 obj_13 obj_08) (pred_2 obj_04 obj_07)
   goals met: 1 of 3
6. (op_3 obj_11 obj_03 obj_10)
   deleted: (pred_4 obj_11 obj_03)
   added: (pred_4 obj_11 obj_10)
   goals met: 1 of 3
7. (op_3 obj_04 obj_08 obj_06)
   deleted: (pred_4 obj_04 obj_08)
   added: (pred_4 obj_04 obj_06)
   goals met: 1 of 3
8. (op_1 obj_11 obj_09 obj_10 obj_01)
   deleted: (pred_1 obj_11 obj_09 obj_01)
   added: (pred_3 obj_09 obj_10) (pred_2 obj_11 obj_01)
   goals met: 2 of 3
9. (op_2 obj_04 obj_02 obj_06 obj_07)
   deleted: (pred_3 obj_02 obj_06) (pred_2 obj_04 obj_07)
   added: (pred_1 obj_04 obj_02 obj_07)
   goals met: 2 of 3
10. (op_3 obj_04 obj_06 obj_10)
   deleted: (pred_4 obj_04 obj_06)
   added: (pred_4 obj_04 obj_10)
   goals met: 2 of 3
11. (op_1 obj_04 obj_02 obj_10 obj_07)
   deleted: (pred_1 obj_04 obj_02 obj_07)
   added: (pred_3 obj_02 obj_10) (pred_2 obj_04 obj_07)
   goals met: 3 of 3
